[


{
  "iFrameUrl": "https://open.spotify.com/embed/track/78T9DulqSBWqkaxczcGBfk?utm_source=generator",
  "title": "Man On The Moon",
  "artist": "Kid Cudi",
  "length": "3:30",
  "credits": "Performed by: Kid Cudi, Written By: Scott Mescudi, Produced by: Emile Haynie",
  "album": "Man On The Moon: The End of Day",
  "date": "January 1, 2009",
  "lyrics": "[Intro]\n(Yawn)\nAlright, run it\nI never gave a f***\nI never gave a f*** about what n****s thought about me\nI mean, I did, but like, f*** it, you know what I'm saying?\nYou gon' love me, man\nYou gon' love me, man\n\n[Verse 1]\nThey can't comprehend\nOr even come close to understanding him\nI guess if I was boring they would love me more\nGuess if I was simple in the mind, everything would be fine\nMaybe if I was a jerk to girls\nInstead of being nice and speaking kind words\nThen maybe it would be okay to say then\nI wasn't a good guy to begin with\n\n[Pre-Chorus 1]\nBut my mind is all crazy, crazy, crazy, crazy\nThey got me thinking I ain't human\nLike I came in from above, above, above, above\nFeeling like an airplane in the sky\nBut then they say I'm crazy, crazy, crazy, crazy\nThey got me thinking I ain't human\nLike I came in from above, above, above, above\nFeeling like a bird sitting high, high\n\n[Chorus]\nI be that man on the moon, I'm that man on the moon\nAnd I'ma do what I do, so do you, hey-hey\nI be posted with my blunt and a brew, my dude\nI'm that man on the moon, I'm up-up on the moon\n\n[Interlude]\nIt's like, I'ma play all my stuff for everybody\nAnd you know, and all my people, they give me feedback\nYou know, and they'll be like\n\"Yo, yo, why, why your s*** sound so different?\"\nYou know what I'm saying?\n\"Why, yo- why, yo- why your s***- like on another level- Why's-\nWhy's it sound so different?\"\nLike that's a bad thing\nAnd I be like, \"Why not, n****?\"\n\n[Verse 2]\nClose my eyes, high in the dark\nIt's a curtain call; come one, come all\nAll I do is try to make it simple\nThe ones that make it complicated\nNever get congratulated\nI'm something different, all aspects\nDon't want a woman just to love her assets\nI'll still wife her up, even with her flat chest\nThe type to get hurt, but that's the past-tense\n\n[Pre-Chorus 2]\nMy mind is all hazy, hazy, hazy, hazy\nI be thinkin' that I'm wrong\n'Cause they used to call me lame, lame, lame, lame\nMy swag was a little different\nBut then my mind is hazy, hazy, hazy, hazy\nI be thinkin' that I'm wrong\nBut they the ones who lame, lame, lame, lame\nI got the last laugh, n****\n\n[Chorus]\nI be that man on the moon, I'm that man on the moon\nAnd I'ma do what I do, so do you, hey-hey\nI be posted with my blunt and a brew, my dude\nI'm that man on the moon, I'm up-up on the moon"
}

,


{
  "iFrameUrl": "https://open.spotify.com/embed/track/0yLsJKNJHmSnmSGl3ZodYn?utm_source=generator",
  "title": "Acid Rap",
  "artist": "Chance the Rapper",
  "length": "3:35",
  "credits": "Performed by: Chance the Rapper, Written by: Chancelor J. Bennett, Jake One, Produced by: Chance the Rapper",
  "album": "Acid Rap",
  "date": "April 30th, 2013",
  "lyrics": "[Verse]\nKicked off my shoes, tripped acid in the rain\nWore my jacket as a cape, and my umbrella as a cane\nThe richest man rocks the snatch-less necklace\nSpineless b*****s in backless dresses\nWore my feelings on my sleeveless\nMy weed seedless, my trees leafless\nI miss my diagonal grilled cheeses\nAnd back when Mike Jackson was still Jesus\nBefore I believed in not believing in\nYeah, I inhaled, who believed in me not breathing in\nCigarette stained smile all covered in sin\nMy big homie died young, just turned older than him\nI seen it happen, I seen it happen, I see it always\nHe still be screaming, I see his demons in empty hallways\nI trip to make the fall shorter\nFall quarter was just a tall order\nAnd I'm hungry, I'm just not that thirsty\nAs of late, all my verses seem not so verse-y\nAnd all my words just mean controversy\nTook the team up off my back, like \"That's not your jersey?\"\nStressin', pullin' my hair out, hoping I don't get picked\nAll this medicine in me hoping I don't get sick\nMaking all of this money hoping I don't get rich\n'Cause n****s still getting bodied for foams\nSometimes the truth don't rhyme\nSometime the lies get millions of views\nFunerals for little girls, is that appealing to you?\nFrom your cubicle desktop, what a beautiful view\nI think love is beautiful too\nBuilding forts from broken dams, what a hoover could do\nFor future hoopers dead from Rugers\nShooting through the empty alley\nCould've threw him an alley-oop\nHelping him do good in school\nD*** that acid burn when it clean ya\nI still miss being a senior\nAnd performing at all those open mic events\nEyes closed, eyes closed seeing arenas\nAnd I still get jealous of Vic\nAnd Vic's still jealous of me\nBut if you touch my brother\nAll that anti-violence s*** goes out the window along with you\nAnd the rest of your team\nSmoking cigarettes to look cooler\nI only stop by to look through ya\nAnd I'm only getting greedier\nAnd I'm still Mr. Youmedia\nAnd I still can't find Talent\nAnd I'm still choosing classmates that wouldn't f***\nMom still thinks I should go back to school\nAnd Justin still think I'm good enough\nAnd Mama Jan still don't take her meds\nAnd I still be asking God to show his face\nAnd I still be asking God to show his face\n\n[Outro]\nI am a new man, I am sanctified\nOh, I am holy, I have been baptized\nI have been born again, I am the White Light\nRain, rain don't go away\nIgh!"
}

,


{
  "iFrameUrl": "https://open.spotify.com/embed/track/5f6esnDQcBiFAm8iMfkw12?utm_source=generator",
  "title": "Silkk da Shocka (feat. Syd)",
  "artist": "Isaiah Rashad, Syd",
  "length": "2:45",
  "credits": "Performed by: Isaiah Rashad, Syd, Written by: Jones Richard Anthony",
  "album": "The Sun's Tirade",
  "date": "September 2nd, 2016",
  "lyrics": "[Intro: Isaiah Rashad]\nYeah, I almost got this\nIf she got it memorized\nThis for the haves and the have-wanna-give-a-f***s\nHey\n\n[Verse 1: Isaiah Rashad & Syd]\nI ride around in your car\nI put my weed in your blunt\nI am the sky to your star\nI am the end of your month\nYou are the start of my day\nYou brought the smile from my face\nI see the world from your eyes\nYou pulled a thorn from my side\n\n[Chorus: Isaiah Rashad, Syd, & Both]\nI know you love me (Know you love me)\nIt's rare, I know you love me (Know you love me)\nOh yeah, I know you love me (Know you love me)\nIt's rare, I know you love me (Know you love me)\nYeah\n\n[Verse 2: Isaiah Rashad & Syd]\nYou give me all that you got\nYou make it stretch it and flip\nI fell in love with your thoughts\nI learned it's more than your hips\nYou know I'm caught in my vibe\nBut I still give you my rib\nYou hear 'em callin' my name\nBut know it's hard for me here\nI left a home with my son\nI chose the world in the end\nI say, \"You know I be back\"\nYou try your best to pretend\nI say you all that I want\nAnd when I make it, it's real\nI hear 'em callin' my name\nIt's gettin' hard for me here\n\n[Chorus: Isaiah Rashad, Syd, & Both]\nTo know you love me (Know you love me)\nIt's rare to know you love me (Know you love me)\nBut yeah, I know you love me (Know you love me)\nIt's rare, I know you love me (Know you love me)\n\n[Verse 3: Isaiah Rashad]\nYeah, yeah, and, and these stars\nAre nothin' but your cousins\nAnd starin' at your mama, Heaven wasn't fallin' in here\nSo holla, you heard I'm usin' narcotics\nNo, I don't wanna be here if I don't gotta\nMy weed habit so close to snortin' powder\nGot a few gripes but it's only 'bout a dollar bill\nSo holla unless you're usin' narcotics\nSee, I don't wanna be here if I don't gotta\nMy weed habit so close to snortin' powder\nGot a few b****es but it's only 'bout a dollar\nFeel so hollow unless you're usin' narcotics\nSee, I don't wanna—\n\n[Outro: Dave Free]\nSay, homie. Man, you talkin' bout this, you talkin' bout that\nTalkin' about, you ain't got nothin' to talk about. Man, my—Find a motherf***in' topic, Goddamn. Just find the topic, bro. Seriously. Goddamn. Complicated-ass young motherf***ers, man."
}

,









{
  "iFrameUrl": "https://open.spotify.com/embed/track/7dFGkZbmm6cVlI28bfMaWE?utm_source=generator",
  "title": "Righteous Minds",
  "artist": "Joey Bada$$",
  "length": "3:43",
  "credits": "Performed by: Joey Bada$$, Written by: Joey Bada$$, Produced by: Bruce Leekix",
  "album": "1999",
  "date": "June 12th, 2012",
"lyrics": "[Intro]\nYeah, make sure my s*** sound tight\n\n[Verse 1]\nI never knew the world could be this mad\nOnly vision I had of sex was Color Me Badd\nAnd I, I never knew the world could be this cold\nOnly time a n**** die, he was playing a role\nBut now n***** get their souls stole' so often\nThey only thing they offer dreamers is a wake and a coffin\nFrom NY, to Compton, down to Austin\nShe said that orphans morph into abortions without precaution\nProblem with our people, there's too many wannabe Jordan\nToo many forces thinking they could make a fortune scorin'\nToo many wannabe actors instead of achieving their masters\nAt least a bachelors but no, too many wannabe rappers, hah\nThat's just statistics, don't mistake me for hypocrites\nLike n***** in the White House supplying Wite-Out\nOn Jim Crow laws, you probably missed it\nHard to be persistent when you're tryin' to fight for your existence\n\n[Chorus]\nIt ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\nYo it ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\n\n[Verse 2]\nPerson mad nervous, you surrender to sterling\nLook them in the eye, if looks made you die, you know you merk 'em\nRight there, plus his hide is like, right here\nSo you know that if you would fight fair, then you'd have him like quite scared\nBut don't forget the TEC held high by your right ear\nSo listen loud and clear: you don't wanna lose your life, dear\nAnd don't you show a slight tear or let 'em sight fear\nJust let 'em disappear in the night air, yeah, with yo' Nike Airs\nRobbed by the crackheads left alone in the apartments\nMothers be jobless, so they make dollars shaking it topless, and\nDaddy been gone, said he took off like ostrich\nSince he gain knowledge, I'm keeping it with the synopsis, and\nS*** like that make you wish you were adopted\nTo escape the pain, you join a gang and get intoxicated\nHave no shame, nothing wrong with some Mary Jane\nThe only thing is you do it again, and again, and again, and again\nAnd again, and again, and again\n\n[Chorus]\nIt ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\nYo it ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\n\n[Interlude]\nIt's a war out here, mad n***** is dyin'\nYou don't want that s*** to be you, right? (Nah)\nI know you gon' hold it down though, you know what I mean?\nJust be careful, man, cause n***** out here ain't really worth it\nYou a ill n**** though, I like ya style, son\n\n[Verse 3]\nImagine me fed up, a go-getter, for mo' cheddar\nPo' never, blow Berettas 'cause I, know no better\nNo Era, no STEEZ, no Kirk, no Lee\nNo school, no OG, no talent, no me\nWhat if I just ain't act right?\nWhat if I pack crack white with my sack tight, join the gat fight?\nThe click-clack type, slide in the vipe with the black stripe\nAnd give my friends the back knife 'cause that's life, n****\n\n[Chorus]\nIt ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\nYo it ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\nIt ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis\nYo it ain't easy livin' life like this\nWhen you tryin' to be righteous but know a n**** might just\nLeave you lifeless for prices, or high tech devices\nSo keep that TEC-9 or meet your crisis"
},

{
  "iFrameUrl": "https://open.spotify.com/embed/track/21O0XXPEWPtePt5RMY93Ob?utm_source=generator",
  "title": "All Caps",
  "artist": "Madvillain, Madlib, MF DOOM",
  "length": "2:10",
  "credits": "Performed by: Madvillain, Madlib, MF DOOM, Written by: Daniel Dumile Thompson, Otis Jackson Jr., Produced by: Madlib, MF DOOM",
  "album": "Madvillainy",
  "date": "March 24th, 2004",
"lyrics": "[Verse 1: MF DOOM]\nSo nasty that it's probably somewhat of a travesty\nHaving me, then he told the people, \"You can call me Your Majesty\"\nKeep your battery charged, you know it won't stick, yo\nAnd it's not his fault you kick slow\nShould've let your trick ho chick hold your sick glow\nPlus nobody couldn't do nothin' once he let the brick go\nAnd you know I know that's a bunch of snow\nThe beat is so butter, peep the slow cutter\nAs he utter the calm flow (\"Your mother—\"), don't talk about my moms, yo\nSometimes he rhyme quick, sometimes he rhyme slow\nOr vice versa, whip up a slice of nice verse pie\nHit it on the first try, villain: the worst guy\nSpot hot tracks like spot a pair of fat asses\nShots of the scotch from out the square shot glasses\nAnd he won't stop 'til he got the masses\nAnd show 'em what they know not through flows of hot molasses\nDo it like the robot to headspin to boogaloo\nTook a few minutes to convince the average bug-a-boo\nIt's ugly, like look at you, it's a damn shame\nJust remember ALL CAPS when you spell the man name\n\n[Verse 2: MF DOOM]\nAnd you know it like a poet, like baby doll\nI bet she tried to say she gave me her all, she played ball\nAll bets off! The Villain got the dice rigged\nAnd they say he accosted the man with the sliced wig\nAllegedly; the investigation is still ongoing\nIn this pesky nation he gots the best con flowin'\nThe pot doubles, now they really got troubles\nMadman never go *pop* like snot bubbles"
},

{
  "iFrameUrl": "https://open.spotify.com/embed/track/7yMiX7n9SBvadzox8T5jzT?utm_source=generator",
  "title": "Clint Eastwood",
  "artist": "Gorillaz",
  "length": "5:40",
  "credits": "Performed by: Gorillaz, Written by: Damon Albarn, Teren Jones, Produced by: Dan The Automator",
  "album": "Gorillaz",
  "date": "2001",
  "lyrics": "[Intro: 2-D]\nHoo-hoo-hoo-hoo-hoo\n\n[Chorus: 2-D]\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nThe future is coming on\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nThe future is coming on\nIt's coming on, it's coming on\nIt's coming on, it's coming on\n\n[Verse 1: Del the Funky Homosapien]\n(Hoo, yeah, haha)\nFinally, someone let me out of my cage\nNow, time for me is nothing, 'cause I'm countin' no age\nNah, I couldn't be there, now you shouldn't be scared\nI'm good at repairs, and I'm under each snare\nIntangible, bet you didn't think, so I command you to\nPanoramic view, look, I'll make it all manageable\nPick and choose, sit and lose, all you different crews\nChicks and dudes, who you think is really kickin' tunes?\nPicture you getting down in a picture tube\nLike you lit the fuse, you think it's fictional?\nMystical? Maybe, spiritual hero\nWho appears in you to clear your view when you're too crazy?\nLifeless to those, the definition for what life is\nPriceless to you, because I put you on the hype shit\nYou like it? Gun smokin', righteous with one toke\nGet psychic among those, possess you with one dose\n\n[Chorus: 2-D & (Del the Funky Homosapien)]\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nThe future is coming on\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nThe future is coming on (That's right)\nIt's coming on, it's coming on\nIt's coming on, it's coming on\n\n[Verse 2: Del the Funky Homosapien]\nThe essence, the basics, without it, you make it\nAllow me to make this childlike in nature\nRhythm, you have it or you don't, that's a fallacy\nI'm in them, every sproutin' tree, every child of peace\nEvery cloud and sea, you see with your eyes\nI see destruction and demise, corruption in disguise (That's right)\nFrom this fin' enterprise, now I'm sucked into your lies\nThrough Russel, not his muscles\nBut percussion he provides for me as a guide, y'all can see me now\n'Cause you don't see with your eye, you perceive with your mind\nThat's the inner (F 'em) so I'ma stick around with Russ and be a mentor\nBust a few rhymes so motherf***ers remember\nWhere the thought is, I brought all this\nSo you can survive when law is lawless (Right here)\nFeelings, sensations that you thought was dead\nNo squealing and remember that it's all in your head\n\n[Chorus: 2-D]\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nThe future is coming on\nI ain't happy, I'm feeling glad\nI got sunshine in a bag\nI'm useless, but not for long\nMy future is coming on\nIt's coming on, it's coming on\nIt's coming on, it's coming on\n\n[Outro: 2-D]\nMy future is coming on\nIt's coming on, it's coming on\nIt's coming on, it's coming on\nMy future is coming on\nIt's coming on, it's coming on\nIt's coming on, it's coming on\nMy future is coming on\nIt's coming on, it's coming on\nMy future is coming on\nIt's coming on, it's coming on\nMy future is coming on\nIt's coming on, it's coming on\nMy future"
},

  {
    "iFrameUrl": "https://open.spotify.com/embed/track/6plT7nFGiXKSBP9HFSI4ef?utm_source=generator",
    "title": "Chum",
    "artist": "Earl Sweatshirt",
    "length": "4:03",
    "credits": "Performed by: Earl Sweatshirt, Written by: Chad Hugo, Kehinde Hassan, Taiwo Hasson, Thebe Kgositile, Produced by: randomblackdude, Christian Rich",
    "album": "Doris",
    "date": "August 16th, 2013",
"lyrics" : "[Chorus]\nSomething sinister to it, pendulum swinging slow\nA degenerate moving through the city with criminals, stealth\nWelcome to enemy turf, harder than immigrants work\n"Golf" is stitched into my shirt\nGet up off the pavement, brush the dirt up off my psyche\nPsyche, psyche\n\n[Refrain]\nCan I get that, oh… let me get that beat in my headphones, louder\n\n[Verse 1]\nIt's probably been 12 years since my father left\nLeft me fatherless\nAnd I just used to say I hate him in dishonest jest\nWhen honestly, I miss this n****, like, when I was six\nAnd every time I got the chance to say it, I would swallow it\nSixteen, I'm hollow, intolerant, skip shots\nI storm that whole bottle, I'll show you a role model\nI'm drunk, pissy, p****** on somebody front lawn\nTrying to figure out how and when the f*** I missed moderate\nMomma often was offering peace offerings\nThink, wheeze, cough, scoffing and he's off again\nSearching for a big brother, Tyler was that\nAnd plus he liked how I rap, the blunted mice in the trap\nToo black for the white kids, and too white for the blacks\nFrom honor roll to cracking locks up off them bicycle racks\nI'm indecisive, I'm scatterbrained, and I'm frightened\nIt's evident in them eyes, where he hiding all them icicles at\n\n[Chorus]\nSomething sinister to it, pendulum swinging slow\nA degenerate moving through the city with criminals, stealth\nWelcome to enemy turf, harder than immigrants work\n"Golf" is stitched into my shirt\nGet up off the pavement, brush the dirt up off my psyche\nPsyche, psyche\n\n[Refrain]\nCan I get that, oh… let me get that beat in my headphones, louder\n\n[Verse 2]\nUh… time lapse, bars rotten, heart's bottomless pit\nWas mobbin' deep as '96 Havoc and Prodigy did\nWe were the pottymouth posse, crash the party and dip\nWith all belongings then toss em out to the audience\nNothing was f****** awesome\nTrying to make it from the bottom\nHis sins feeling as hard as Vince Carter's knee cartilage is\nSupreme garment and weed gardeners garnishing spliffs\nWith Keef particles and entering apartments with 'zine article\nTolerance for boundaries, I know you happy now\nCraven and these Complex f*** n***** done track me down\nJust to be the guys that did it, like, "I like attention"\nNot the type where n***** trying to get a raise at my expense\nSupposed to be grateful, right?\nLike, "Thanks so much," you made my life harder\nAnd the ties between my mom and I are strained and tightened\nEven more than they were before all of this s***\nBeen back a week and I already feel like calling it quits\n\n[Chorus]\nSomething sinister to it, pendulum swinging slow\nA degenerate moving through the city with criminals, stealth\nWelcome to enemy turf, harder than immigrants work\n"Golf" is stitched into my shirt\nGet up off the pavement, brush the dirt up off my psyche\nPsyche, psyche\n\n[Outro]\nCan I get that, oh… let me get that beat in my headphones, louder\n "
  },
 {
    "iFrameUrl": "https://open.spotify.com/embed/track/3djWekEDgbhAtkXGdFNbFt?utm_source=generator",
    "title": "BALD!",
    "artist": "JPEGMAFIA",
    "length": "2:33",
    "credits": "Performed by: JPEGMAFIA, Written by: JPEGMAFIA, Produced by: JPEGMAFIA",
    "album": "EP!",
    "date": "November 6th, 2020",
    "lyrics": "[Intro]\nYeah\nF*** that, woah, uh\n[Verse 1]\nF*** that b****, I changed the plan\nSwitch my style like I switch hands\nBlock the witness, take the stand\nF*** out the way b****, back it up\nShit better get played in a palace (Word)\nI can't treat n****s like big deals\nWhy put up a front? I’m callous\nBald (Ha), I look like Ray Allen (Real)\nThese n****s make beats on big wheels\nYo' files is not a challenge (Nah)\nBoy, you can't rap for s***\nShuttlesworth blessed me with talent\nHairline proof God needs balance\nBald\n[Bridge]\n(I'm makin' waves, bro)\nUh, look, I'm cashin' out\nYoung Darby, I'm taggin' in\nThey gon’ bring your casket out\nI hope that you fit in it (Ooh)\nWhat you doin', babe?\nHow you get caught with no Gat? (Yeah, yeah)\nYou n****s must got no pride\nPeggy gon' give you no slack, for real\n'Cause you p***y\n[Verse 2]\nWoah, woah, woah\nKeep my business off the 'Gram\nSwitch my style like I switch hands\nGoin' to war on foreign land\nF*** out the way b****, back it up\nShit better get played in a palace\nWait, uh, I can't treat n****s like big deals (Yeah)\nThese toys don’t come with no kid's meal\nBeen there, done that, done seen it\nNot my girl but I f*** her like she is (Sad)\nThey be f***ing up my lyrics on Genius\nAnd these p***y a** critics repeat it\nBeen the same since Even Stevens\nY'all n****s switch like the seasons (Facts)\nY’all lives ain’t got no meaning (Why)\nAnd them deals ain’t got no freedom\nI can't just loop it and leave it\nGotta smack it up, rip it up, and eat it (Yeah, ha)\n[Outro]\nHah!\nYou can't feed your kid 'cause you spent that s*** on your car (You broke)\nTape my hands, I’m going over squares' heads like a VCR (Ha)\nBald\n"
}
,
 {
    "iFrameUrl": "https://open.spotify.com/embed/track/3GXSywNvYLAVUCtjMHkKDh?utm_source=generator",
    "title": "E. Coli (feat. Earl Sweatshirt)",
    "artist": "The Alchemist",
    "length": "2:12",
    "credits": "Performed by: Earl Sweatshirt, Written by: The Alchemist, Earl Sweatshirt, Produced by: The Alchemist",
    "album": "Bread",
    "date": "November 30th, 2018",
    "lyrics": "[Intro]\nYou see the songs, they're-\nIt's what I do\nJust write the songs and sing them\nTherefore it's pure feeling\nIt's complete honesty\nIf you can place the origin of your fear, it will disappear\n[Verse]\nMy thoughts, dreams, plots, and my schemes\nThat's what's on my mind when I toss in my sleep\nMy heart like my pen when I jot and it bleed\nMy cart full of sin, when I shop it's a spree\nI got some new leaves\nI'm like \"What's the word with you, sir?\"\nYou just moss on a tree, I'm not concerned with you\nI leave the curb when I'm crossing the street\nI'm watching out for the Mark of the Beast\nThe badge on the policeman, black carpenter pants\nA half ounce in 'em, another half ounce in my fleece\nAnd on account of this, go ‘head and count me out of this\nI'm out with the breeze\nI'm dodging county, it's a thousand degrees\nIt's back alley s***, my n****, look\nMy eyes wide open, I'm sleepy, I'm on a highway\nPaul Giamatti, a n**** was sittin' sideways\nA bubble and a Skully when traveling through the Tri-state\nAnd trouble play the gun, hear it clap and it make my mind race\nBack and forth, I place fourth, keep your torch\nGot your morsels on my plate, mfer\nI wasn't born, mama snatched me off the mfing stork on a Friday\nSay that s*** to my face\n[Outro]\nIf you listen sometimes, you can, you can get a whole conversation full of people talking\nTwo bars and a song sometimes\nFor me, knowledge is everything\nStill learning?\nYeah-\nI learned my whole life\nI learned something last night\n"
}
,



{
    "iFrameUrl": "https://open.spotify.com/embed/track/4sY3JiBfTCqInH7Tov3dxx?utm_source=generator",
    "title": "Trade-Off",
    "artist": "Flatbush Zombies",
    "length": "4:09",
    "credits": "Performed by: Flatbush Zombies, Written by: Flatbush Zombies, Produced by: Erick Arc Elliot",
    "album": "3001: A Laced Odyssey",
    "date": "March 11th, 2016",
    "lyrics": "[Chorus: Erick the Architect]\nIt's that work hard, play hard\nMake you quit that day job\nI smoked so much this year, we couldn't even take a day off\nI plan to take a trip\nWant the money how it's spent\nI just re-up\nPlus I just paid my phone and the rent\n[Verse 1: Erick the Architect]\nHey, it's lit\nCall my partners up, we goin' up, you slowin' up\nI never judge, we do indulge\nIn truth, I never touch the stuff\nOne puff of that fluffy stuff, s*** hit me like a sucker punch\nSide effects include mass paranoia plus the cotton mouth\nDown another bottle with my n****s\nBefore this was a movie, we pictured us livin' bitter\nAnd I forgive 'em, whatever, whatever\nTellin' me different, nothin' is given\nWithout sacrifices, somethin' is close to n****s to chill with\nPray for the children\nThe government spikin' penicillin\nAnd Lord willin'\nWe all live to be twenty million\nOutcome infinite dawg, where is the ceilin'?\n'Cause five years ago we came to be without disappearin'\n[Chorus: Erick the Architect & Zombie Juice]\nIt's that work hard, play hard\nMake you quit that day job\nI smoked so much this year, we couldn't even take a day off\nI plan to take a trip\nWant the money how it's spent\nI just re-up\nPlus I just paid my phone and the rent\nIt's that work hard, play hard\nI just got a b*** job\nSmoke so much this year, we couldn't even take a day off\nTwenty-somethin' years, I never had a f*** day job\nNever ask for truth, it's what expected, it's a trade-off\n[Verse 2: Zombie Juice]\nReal n**** s***, gettin' money bound to flip\nNow turned on like I'm the s***\nB***, I told you how it gets\nIt's that mixtape rap, blunt wrapped up in a album\nIn a Audi black, tote straps lookin' for yack\nSo I can go top speed with the blinkers on\nScreamin' \"F*** the world\", Martin King is gone\nWho am I? Who am I?\nHandsome guy, might stunt on you n****s with a patch on my eye\nPlease turn up the headphones, I speak the value\nI pray for freaks, we gon' bring the outcome\nToke, toke and choke\nWe just need your vocals\nSo this is the future, ain't what your used to\nFour years ago I was poorer than you are\nTrappin' in the lobby and the back of a U-Haul\n[Chorus: Zombie Juice, Erick the Architect & Meechy Darko]\nIt's that work hard, play hard\nI just got a b*** job\nSmoke so much this year, we couldn't even take a day off\nTwenty-somethin' years, I never had a f*** day job\nNever ask for truth, it's what expected, it's a trade-off\nIt's that work hard, play hard\nMake you quit that day job\nI smoked so much this year, we couldn't even take a day off\nI plan to take a trip\nWant the money how it's spent\nI just re-up\nPlus I just paid my phone and the rent\nThis that work hard, play hard\nRest in peace to Trayvon\nDid so much different drugs this year, I'm feelin' so amazin'\nLSD, them potent doses, smokin' 'til I take off\nTwo freaks, one Meech, that's an even trade-off\n[Verse 3: Meechy Darko]\nRosemary's baby, the hand that rock my cradle to the grave\nI had six exorcisms this year alone and I feel the same\nI'm high and sleep deprived, havin' nightmares while I'm still awake\n40 ounce sipper, until my liver give away\nI think I lost my mind and I'm willin' to trade my soul if you can find it\nAn even exchange, I'm young and deranged\nAll these drugs in my body\nRawer than the kilo under my granddaddy pillow\nKill a cop, la-la-laugh, reload\nHa-ha-ha, drop classics, we know\nLaugh at you n****s\nI average fifty, I don't feel the need to pass to you n****s\nRoll up the sticky, young irrational n****\nDon't throw stones unless your crib is shatter-proof n****\nA headshot, now let's see if you splatter-proof n****\n"
}
,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/1AHfovSnGPVYKaahRtA0U6?utm_source=generator",
  "title": "The Message",
  "artist": "Nas",
  "length": "3:54",
  "credits": "Performed by: Nas, Written by: Poke (of The Trackmasters), Samuel Barnes, Nasir Jones, Produced by: Poke and Tone for TrackMasters Entertainment",
  "album": "It Was Written",
  "date": "July 2nd, 1996",
  "lyrics": "Fake thug, no love, you get the slug, CB4 Gusto\nYour luck low, I didn't know til I was drunk though\nYou freak n****z played out, get f***ed and ate out\nProstitute turned b****, I got the gauge out\n\n96 ways I made out, Montana way\nThe Good-F-E-L-L-A, verbal AK spray\nDipped attache, jumped out the Range, empty out the ashtray\nA gla** of 'ze make a man Ca**ius Clay\n\nRed dot plots, murder schemes, thirty-two shotguns\nRegulate wit my Dunn's, 17 rocks gleam from one ring\nYo let me let why'all n****z know one thing\nThere's one life, one love, so there can only be one King\n\nThe highlights of livin, Vegas style roll dice in linen\nAntera spinnin on Milleniums, twenty G bets I'm winnin them\nThreats I'm sendin them, Lex with TV sets the minimum\nIll sex adrenaline\n\nParty with villians, a case of Demi-Sec to chase the Henny\nWet any clique, with the semi-tech who want it\nDiamonds I flaunt it, chickenheads flock I lace em\nFried broiled with basil, taste em, crack the legs\n\nway out of formation, it's horizontal how I have em\nf***in me in the Benz wagon\nCan it be Vanity from Last Dragon\nGrab your gun it's on though\n\nS*** is grimy, real n****z buck in broad daylight\nwith the broke Mac it won't spray right\nDon't give a f*** who they hit, as long as the drama's lit\nYo, overnight thugs, bug cause they ain't promised s***\nHungry-a** hooligans stay on that piranha s***\n\n[Chorus: x 4]\n\"I never sleep, cause sleep is the cousin of death\" -> Nas\n\"I ain't the type of brother made for you to start testin\" -> Nas\n\n[Nas]\nI peeped you frontin, I was in the Jeep\nSunk in the seat, tinted with heat, beats bumpin\nAcross the street you was wildin\nTalkin bout how you ran the Island in eighty-nine\n\nLayin up, playin the yard with crazy shine\nI c***ed a baby 9 that n**** grave be mine, clanked him\nWhat was he thinkin on my corner when it's pay me time\nDug em you owe me cousin somethin told me plug him\n\nSo dumb, felt my leg burn, then it got numb\nSpun around and shot one, heard shots and dropped son\nCaught a hot one, somebody take this biscuit 'fore the cops come\nThen they came askin me my name, what the f***\n\nI got stitched up and went through\nLeft the hospital that same night, what\nGot my gat back, time to backtrack\nI had to drop so how the f*** I get clapped\n\nBlack was in the Jeep watchin all these scenes speed by\nIt was a brown Datsun, and yo nobody in my hood got one\nThat clown n****'s through, blazin at his crew daily\nThe 'Bridge touched me up severely hear me?\n\nSo when I rhyme it's sincerely yours\nBe lightin L's sippin Coors, on all floors in project halls\nContemplatin war n****z I was cool with before\nWe used to score together, Uptown coppin the raw\n\nBut uhh, a thug changes, and love changes\nand best friends become strangers, word up\n\n[Chorus: x 4]\n\"why'all know my steelo\" -> Nas\n\"There ain't an army that could strike back\" -> Nas\n\n[Nas]\nThug n****z\nYo, to them thug n****z gettin it on in the world you know?\nTo them n****z that's locked down\ndoin they thing survivin yaknowmsayin?\n\nTo my thorough n****z, New York and world wide\nYo to the Queensbridge Militia\n9-6 s***.. The Firm clique, Illmatic n****\nIt Was Written though\n\nIt's been a long time comin\nwhy'all fake n****z, tryin to copy\nbetter come with the real though\nFake a** n****z yo..\n\n(They throw us slugs we throwin em back, what?)\nBring the s*** man, live man\n(F*** that son)\nNine-six s***.."
}

,


{
  "iFrameUrl": "https://open.spotify.com/embed/track/0wJw5QXDKXTYn8IVyh3wqz?utm_source=generator",
  "title": "Samurai",
  "artist": "Lupe Fiasco",
  "length": "3:14",
  "credits": "Performed by: Lupe Fiasco, Written by: Wasalu Jaco a/k/a Lupe Fiasco, Produced by: Soundtrakk, Kush Baby",
  "album": "Samurai",
  "date": "June 28th, 2024",
  "lyrics": "[Intro]\n(And they say, and they say, and they say, say)\nWhat they say, what they say now? (They say, they say)\nUh-huh, uh-huh (They say, they say, they say-ay-ay-ay)\nI'd like to welcome everybody out to the Samurai\n(They say, they say, they say)\nIndeed, indeed, indeed, indeed, baby\nHere we go, one time, yeah\n\n[Chorus]\nI got these, really neat (Really neat, really neat)\nVery beautifully alliterated (Very beautiful, uh)\nLittle battle raps for you (Little battle rap, little battle rap, yeah)\nI got these, really neat (What you got? Huh, uh)\nVery beautifully alliterated (Yeah, yeah, yeah)\nLittle battle raps for you (Talk to 'em like, c'mon)\nSo come on through\n\n[Verse 1]\nBig eyes looking like skies in binoculars\nTwo nights live, singing by the opera house\nBut not in it, just by it\nSomeone alongside it, a long silence\nA strong, vibrant meditative song of guidance\nDesigned to raise eyelids of blind men, saved assignments\nWith warm regards and age kindness for today's climate\nAnd the vain of gang violence meets the gangs's demises\nAnd it— bangs! Rises like wings on a plane\nPlus a pilot who can fly it into the eye of Hurricane Iris\nStylish, same shoe in different sizes\nWith evidences of the mileage and the growth\nTop hats and coats\nTuxedos and throats, where the bowties posts\nFolks look past the lower-class blower of the notes\nAnd tell unspoke jokes as they approach\nWhich she'd never be inside, but she hopes\n\n[Chorus]\nI got these (Yeah) really neat (Really neat, really neat)\nVery beautifully alliterated (Very beautiful, uh)\nLittle battle raps for you (Little battle rap, little battle rap, yeah)\nI got these, really neat (Really neat, huh)\nVery beautifully alliterated (Wassup, wassup)\nLittle battle raps for you (Yeah, uh, uh)\nSo come on through\n\n[Verse 2]\nThe unamplified, fantasize land\nOf the soon-to-be fans of the samurai\nSmile wide, got the panorama camera vibe\nIf you analyze, she's a one-woman gala, glamorized\nJust without the glamor or the gala ties\nMet 'em all live with the jazz guys\nEating piano pies at the Vanguard\nShe's a artist and starved\nA couple dollars in the band jar buys a half a turkey sam\nOrganic and it's hand-carved and ours\nIf you ask for a piece, freshly laugh for singing jazz in the streets\nAnd the staff ask for police (Damn)\nCrashed at a friend's flat for a week (For a week)\nFelt as home as a raft on the beach (On the beach)\nLit a fag, took a drag, took a tea (Took a tea)\nRead a book, took a bath, went to sleep\n\n[Chorus]\nI got these, really neat (You know what I'm sayin'? Yeah)\nVery beautifully alliterated (Very beautiful, uh)\nLittle battle raps for you (Little battle rap, little battle rap for you)\nI got these, really neat (Really neat, really neat, ay)\nVery beautifully alliterated (Very beautiful, yeah)\nLittle battle raps for you (Little battle ra-a-a-a-a-ap)\nSo come on through\n\n[Outro]\nI'd like to welcome everybody out\nYeah, to the Samurai, Samurai\nUh-huh, to the Samurai, uh"
}

,








{
  "iFrameUrl": "https://open.spotify.com/embed/track/2ej1A2Ze6P2EOW7KfIosZR?utm_source=generator",
  "title": "Feather (feat. Cise Starr & Akin from CYNE)",
  "artist": "Nujabes, Cise Starr & Akin from CYNE",
  "length": "2:55",
  "credits": "Performed by: Cise Starr & Akin from CYNE, Nujabes, Written by: Cise Starr & Akin from CYNE, Nujabes, Produced by: Nujabes",
  "album": "Modal Soul",
  "date": "November 11th, 2005",
  "lyrics": "[Verse 1: Cise Starr]\nLight as a feather when I'm floating through\nReadin' through the daily news, measurin' the hurt within the golden rule\nCentimetres of ether, I'm heatin' the speaker\nMotivational teacher with words that burn people\nSeein' the headlines lined with discord\nIt's either genocide or the planet in uproar\nNever good, the rules of paradise are never nice\nThe best laid plans of Mice and Men are never right\nI'm just a Vagabond with Flowers for Algernon\nAn Average Joe who knows what the fuck is goin' on\nIt's the hope of my thoughts that I travel upon\nFly like an arrow of God until I'm gone, so I'm\n\n[Chorus: Cise Starr]\nDriftin' away like a feather in air\nLetting my words take me away from the hurt and despair\nSo, I'm keepin' it vertical forever elevator\nRidin' the escalator to reach somethin' that is greater, so I'm\nDriftin' away like a feather in air\nLettin' my soul take me away from the hurt and despair\nSo, I'm keepin' it vertical forever elevator\nRidin' the escalator to reach something that is greater\n\n[Verse 2: Akin Yai]\nTaking chances, word tap dancin' with wolves\nIn an ice arena out there, deep in the woods of\nArizona, the sun be high, life's ironic, ain't it?\nTrying to be Dalí when I write\nSurreal Life, I paint it\nVivid, habitat crazy insane\nWatchin' propaganda six o'clock news and it’s saying\nCultures clash, poor black folk and white trash\nThey revel in the cyberspace that might crash, dash\nTo millennium a million miles of runnin'\nAt the speed of now back, don't return gunnin'\nRambo style, gung-ho child gunnin'\nAmmo blao two times, loud stunnin'\nStunnin', when I hit ya, lift you off the Earth like\nAyo, take you right back to birth\nAnd niggas wonder why, they might wonder why\nThis shit might happen but it does, they go\n\n[Chorus: Cise Starr]\nDriftin' away like a feather in air\nLettin' my words take me away from the hurt and despair\nSo I'm keepin' it vertical forever elevator\nRidin' the escalator to reach something that is greater, so I'm\nDriftin' away like a feather in air\nLettin' my soul take me away from the hurt and despair\nSo, I'm keepin' it vertical forever elevator\nRidin' the escalator to reach something that is greater\n\n[Verse 3: Cise Starr]\nTreat you better than me 'cause that's the heavenly key\nTo unlock the inner strength where my essence will be\nIt's the knowledge and self-understanding of the things around me\nThat becomes the wisdom that I need\nLivin' this life to the best of my ability\nChannelin' energy to my thoughts, attain symmetry\nRemember me, because my prose remain gold\nI got the gift of gab like them pimps in Kangol\nIt never ends, I keep it rolling like a cypher\nThe first caveman bringin' fire\nInnovating and higher; to plasma states I raise the stakes\nIt's double or nothing in this vacuum space\nI will, survive, divine the time to cry\nFuck a hold or hide, I'm alive with pride\nAnd I drove the Chevy to the Levy\nBut the Levy was dry, singin', \"This will be the day that I die\""
}

,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/1fOkmYW3ZFkkjIdOZSf596?utm_source=generator",
  "title": "Pink Matter",
  "artist": "Frank Ocean, Andre 3000",
  "length": "4:28",
  "credits": "Performed by: Andre 3000, Frank Ocean, Written by: Andre Benjamin, James Ho, Lonnie Breaux, Produced by: Malay, Frank Ocean, Om'Mas Keith",
  "album": "channel ORANGE",
  "date": "July 10th, 2012",
"lyrics" : "[Intro: Frank Ocean]\nAnd the peaches and the mangos\nThat you could sell for me\n\n[Verse 1: Frank Ocean]\nWhat do you think my brain is made for\nIs it just a container for the mind?\nThis great grey matter\nSensei replied, \"What is your woman?\nIs she just a container for the child?\"\nThat soft pink matter\n\n[Chorus: Frank Ocean]\nCotton candy, Majin Buu, oh, oh, ohh\nClose my eyes and fall into you, you, you\nMy God, she's giving me pleasure\n\n[Verse 2: Frank Ocean]\nWhat if the sky and the stars are for show\nAnd the aliens are watching live\nFrom the purple matter?\nSensei went quiet then violent\nAnd we sparred until we both grew tired\nNothing mattered\n\n[Chorus: Frank Ocean]\nCotton candy, Majin Buu, oh, oh, oh, oh\nDim the lights and fall into you, you, you\nMy God, giving me pleasure\nPleasure, pleasure, pleasure\nPleasure over matter\n\n[Verse 3: André 3000]\n(Hey, hey)\nSince you been gone, I been having withdrawals\nYou were such a habit to call\nI ain't myself at all, had to tell myself, \"Naw\nShe better with some fella with a regular job\"\nI didn't wanna get her involved\nBy dinner Mr. Benjamin was sitting in awe\nHopped into my car; drove far\nFar's too close and I remember my memory's no sharp\nButter knife, what a life, anyway\nI'm building y'all a clock, stop, what am I, Hemingway?\nShe had the kind of body that would probably intimidate\nAny of 'em that were un-southern, not me, cousin\nIf models are made for modelin'\nThick girls are made for cuddlin'\nSwitch worlds and we can huddle then\nWho needs another friend? I need to hold your hand\nYou'd need no other man, we'd flee to other lands\n\n[Bridge: Frank Ocean]\nGrey matter\nBlue used to be my favorite color\nNow I ain't got no choice\nBlue matter\n\n[Outro: André 3000]\nYou're good at being bad, you're bad at being good\nFor heaven's sakes, go to hell, nah, knock on wood, hey\nYou're good at being bad (You're bad at being good)\nFor heaven's sakes, go to hell (Knock on wood)\nFor heaven's sakes, go to hell\nKnock, knock, knock, knock on wood\nWell, frankly, when that ocean so m***f***ing good\nMake her swab the m***f***ing wood\nMake her walk the m***f***ing plank\nMake her rob a m***f***ing bank\nWith no mask on and a rusty revolver"
},



{
  "iFrameUrl": "https://open.spotify.com/embed/track/19O7OqzwiT0U5DKec68WJR?utm_source=generator",
  "title": "Scottie Pippens (feat. Freddie Gibbs)",
  "artist": "Curren$y, The Alchemist, Freddie Gibbs",
  "length": "3:07",
  "credits": "Performed by: Curren$y, Freddie Gibbs, Written by: The Alchemist, Produced by: The Alchemist",
  "album": "Covert Coup",
  "date": "January 1st, 2011",
"lyrics" : "[Intro: Curren$y]\nYeah\nYeah\nWhere haven't we\nJet Life, Jet Life, Jet Life\nJet Life, Jet Life, Jet Life\nYou should be rollin' up by now\nYeah\nGo get your lighters (Ugh)\n\n[Verse 1: Curren$y]\nShowin' no signs of lettin' up\nStill kick you in the head like I think you on the verge of gettin' up\nNo mercy, Cobra Kai, Cobra Commander\nDeadly, venom-spitting; n****s just a salamander\nI'm living a life worthy of capturing on camera, documented\nHow one of the last live ones did it\nHow I rolled up in the drop, how I rolled up that sticky\nHow I rolled with them women, elegant player, no simpin'\nHow I f***ed 'em to sleep\nHow I rolled up out the building when I was finished, keep it G\nThem n****s not original, they muh'f***in' House of Mirrors\nNot quite the image\nI'm on that Popeye spinach, Mama mai-tai sippin'\nShe love a square n***a, but now, she tryin' somethin' different\nWindy City Bulls, Mitchell & Ness wool jackets, some sweats, and Scottie Pippens\nMy description: high off that fuzzy, green prescription—\nLyin' if I sayin' that I isn't; if you lookin' for that n***a, I is him\nAll eyes in this direction, a burden and a blessing\n\n[Interlude: Curren$y & Freddie Gibbs]\nYeah, yeah\nUgh\nFor sure\nJet Life, Jet Life, Jet Life\nJet Life, Jet Life, Jet Life\n\n[Verse 2: Freddie Gibbs]\nUgh, reporting live from the devil's palace (Yeah)\nBreakfast, had two t***ies, two blunts and a turkey-bacon sandwich (Yuh)\nTwo seasoned eggs and grape jelly, my hoes stay ready (Ugh)\nPop that p***y then peeled off in my Pontiac on Pirellis\n'82 edition, spotless Bonnie squattin' on sixes (Ugh)\nRather be countin' stacks than stuck in the county, washin' the dishes (Nah)\nOr washing drawers in the pen (Nah); got two zones of soft and some Hen'\nI had go pay the correct correctional officer to walk 'em in (On them)\nBail money on deck, come at my neck (Yeah)\nBless that boy 'cause that same place him test is where he slept\nI issue eternal rest, sign up and be a subscriber (Yeah)\nThe price of life got so high that I must make sure I stay higher\nStay with the p***p out of pee-zo, stay smackin' these geekers' needles\nStay runnin' the rock just like I play quarterback for the Eagles\nRandall, Donovan, or Michael\nFore I picked up this mic, I was hittin' licks with some Lords and did dirt with plenty Disciples\nI'm gangbang affiliated (Ugh), federal-investigated, self-educated\nAll my co-conspirators catchin' cases (Yeah)\nI dropped straight out of college, and I majored in home invasion\nBelieve, I got the b***s to clear up all of my altercations\nLeave faces with alterations, the closed-casket console (Yeah)\nTryin' to make a million dollars, f*** a million downloads\nBut if that equal the same, then slice that up and give me my change\nI made a lane up in this game so n****s got’ remember the name:\nGangsta Gibbs, ho! Two b***hes cooking in the crib, ho (Yeah)\nStill push a bucket, but I ride it like a Benz, ho (Yeah)\nTryna find a bridge ho, to slangin' raps from slangin' weight (Ugh)\nSaid that Fred the new-age Brad, b***h, call me Baby Face Killa\n\n[Outro: Freddie Gibbs]\nUgh, ugh"

},

{
  "iFrameUrl": "https://open.spotify.com/embed/track/5psl7bZImUdYdKfajE2r2v?utm_source=generator",
  "title": "6 Five Heartbeats (feat. Vince Staples)",
  "artist": "The Alchemist, Vince Staples",
  "length": "1:54",
  "credits": "Performed by: The Alchemist, Vince Staples, Written by: The Alchemist, Produced by: The Alchemist",
  "album": "This Thing of Ours 2",
  "date": "October 8th, 2021",
  "lyrics": "[Sample: Eddie Griffin]\nBlew-blew-blew-blew-blew\nLord, clearing out like roaches when the light come on\nThat motherf***er walk out, don't nobody know what happened\nHe still praying\n\n[Intro: Vince Staples]\nYeah, yeah, yeah\nYeah, yeah, ayy\nYeah\n\n[Verse: Vince Staples]\nYou had a blog; we had Berettas, ayy\nCouldn't buy no birds; we fly together, ayy\nHow has every single rapper been a dopeman?\nReally tryna kill cuh, lift it up with both hands\nIs you pushing for real? Talking rocks, Xans\nI done slid enough to see a Glock jam\nCouldn't take the heat, so you bought fan, yeah\nEvery stream freshwater; limousine tints sparkle\nIf I can't see you, you got something to hide\nTold me all I ever do is f*** her and lie, yeah\nAt least you happy, though; bag Dior\nMy momma helped my daddy bag the dope—that's real love\nI'm searching for some real love\nSomeone to set my heart free\nShot him on the eight-block, I hope nobody saw me\nWhen there's problems, call me; they know the way my heart beat\n[Sample: Eddie Griffin]\nI told you, you know how I am\nYou go on and sort him out, 'cause he wasn't cool 'round here"
}
,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/1jzIJcHCXneHw7ojC6LXiF?utm_source=generator",
  "title": "Potato Salad",
  "artist": "Tyler, The Creator, A$AP Rocky",
  "length": "3:02",
  "credits": "Performed by: Tyler, The Creator, A$AP Rocky, Written by: Missy Elliott, Craig Brockman, Lee Hatim, Melissa Elliot, Monica Brown, Rakim Meyers, Tyler Okonma, Produced by: Tyler, The Creator",
  "album": "Single",
  "date": "September 28th, 2018",
  "lyrics": "[Intro: Tyler, The Creator]\nYo, now you gon' start me from the top? Listen\nShout out Harlem, man\nShout out A$AP Rocky, man\nAWGE in the building, man\nWhat's good? Is that potato salad?\nYo, listen\n\n[Verse 1: Tyler, The Creator]\nN****s give me the cold shoulder, I can speak for myself\nSo I keep a high waist and alligator the belt\nAnd got a belt with the holster, I ain't playing games\nBut got some lil' n****s who would do it so I pass the controller\nYou get pressed and X out, tri-angle your nose\nPause your life if you squares try to mess with my O's, woah\nSo cut the crap like sh** barbers\n'Cause we really with the beef like closeted gay fathers\nN**** we get dollars, give 'em to Ben Baller\nExchange for them chains that's all shiny with thick water\nI got back pains, neck heavy like whipped cream\nMy whip clean, and they all white, I whip cream\nAnd cop boys and I joystick, I whip cream and cop cribs\nI got more space than big jeans, y'all sleeping on me\nExplain why they got sh** dreams\nI'm alien, got the laser gun with the big beam\nMarried to the money, my b***h green\nNo I don't sip lean, but ride around in rockets like Yao Ming\nY'all n****s weak\nThey thought I was goofy and all mouses\nDouble C my luggage and fill them with Comme blouses\nY'all cop kush, my n**** I cop houses\nAnd fill 'em with some Leo DiCap's and some Cole Sprouses, n****\nWhere we? Rocky, A$AP\nGOLF, boy, where we at? N**** in Paris\n\n[Verse 2: A$AP Rocky]\nF*** clothes, I cop pieces\nCouple thots with me and them hoes is like divas\nGot my Vans on but they look like sneakers\nFlipped a couple packs, BasedGod in the speakers\nBass all in the speakers\nIn the field like baseball, play ball, face wall when polices come\nI don't rock Chanel, I rock channel\nAnd no this ain't a purse, it's a satchel (At you)\nBless, at you, nah, I ain't sneeze\nBut if n****s want steam or smoke, bet I match you\nGot a bullet with your name on the barrel\nIf hollows don't clip, you get nip like it's cat food\nThat dude, when I die, they gotta make a statue\nBad attitude, this ain't a purse, it's a satchel\nGo to any n**** with money up in my bracket\nThen I think about the state of rapping\nAll the freshmens in the classes\nAll the super seniors' mumblin' and ramblin'\nMumblin' and rappin', mumble rapping?\nI find it hard to find actual talent\nI find it hard to find an actual challenge\nI'm like Shabazz Palace's last acid hit, elaborate\nRap lab's labyrinth, word to Kodak's Black's Lazarus\n\"CALLDROPS\" on the album skits\n\n[Verse 3: Tyler, The Creator]\nAyo, I'm the channel that you watch, I'm the ammo in the Glock\nWeird n****, full suit with the sandals and the socks, stop\nAnd based on my neck boy\nYou would think I hate glass homes way I'm handling the rocks\nWho cast the first stone? B****, it's me, f*** you thought?\nReal grunge n****, I ain't got a flannel as the top\nAnd I'm picking up guitar, strum n****\nBum n****s wish they could make a garden shed\nBut they sleeping on me man like their arm is dead\nI'm a wild n**** boy and you farmer bred, born\nYou ain't animal, you are, corn, hahaha, yeah!\n\n[Outro: Tyler, The Creator]\nK shiz, what up, n****!"
}
,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/6efkcs2aUBMFKxl0cl2JWQ?utm_source=generator",
  "title": "Wild Irish Roses",
  "artist": "Smino",
  "length": "2:49",
  "credits": "Performed by: Smino, Written by: Ahmanti Booke, Christopher Smith Jr., Produced by: monte booker",
  "album": "blkswn",
  "date": "March 14th, 2017",
  "lyrics": "[Intro]\nYou got Woods in here? Backwoods\n(Backwoods)\n\n[Chorus]\nIt ain't no Backwoods on this side of town\nWanna ride with me to get some more?\nPick a couple of Wild Irish Roses (Roses)\nYou lookin' mm-mm-mm delectable\nMade arrangements for that edible\nDouble booked, it's cool, your friend can roll through\nCasa su casa, how's yo' Spanish?\nYou kick it off, home field advantage\nGot Gatorade on ice, lil' boo, stay cool\nSecond stop we done made\nCan't find no Woods and it's gettin' late\nI might just pull over\nMm-mm-mm-mm\nMm-mm-mm\n\n[Verse]\nLil shawty got me standin' at attention\nCuidado\nThis that two-a-day bench press repetition\nEquinox, oops, I mean Equinox\nSmeezy F Baby and the F is for Faneto\nTriangles, down, up, circle\nMy dick a cheat code, I stick for the joy\nShe sayin' it's sweet, callin' me chico\nI dig in her earth deep and she quakin'\nI'm from Jupiter, baby, get with an alien\nCrazy, I popped a little somethin'\nI'm seein' 3D (Ooh)\nWe saw Nefertiti, you won't believe me (Ooh)\nPosted up like a lamp, come rub on a genie\nI know you wish for forever, ever, you see me\nMy stones rolling, but fuck it, you rockin' with me\nYeah, you rockin' with me\nSomethin' 'bout your lil' convo, you do somethin' for me\nAnd I ain't cold with geometry, but you a cute mothafucka\n\n[Chorus]\nIt ain't no Backwoods on this side of town\nWanna ride with me to get some more?\nPick a couple of Wild Irish Roses (Roses)\nYou lookin' mm-mm-mm delectable\nMade arrangements for that edible\nDouble booked if it's cool, your friend can roll through\nCasa su casa, how's yo' Spanish?\nYou kick it off, home field advantage\nGot Gatorade on ice, lil' boo, stay cool\nSecond stop we done made\nCan't find no Woods and it's gettin' late\nI might just pull over\nMm-mm-mm-mm\nMm-mm-mm\n\n[Outro]\nIt ain't no Backwoods on this side of town\nWanna ride with me to get some more?\nPick a couple of Wild Irish Roses"
}
,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/14246VCxRDGZHqlMlqWSz4?utm_source=generator",
  "title": "Wave Gods",
  "artist": "Nas, A$AP Rocky, DJ Premier",
  "length": "3:10",
  "credits": "Performed by: Nas, A$AP Rocky, Written by: Chauncey Hollis Jr., Chris Martin, Corey Penn, Nasir Jones, Rakim Mayers, Produced by: Hit-Boy",
  "album": "Magic",
  "date": "December 24th, 2021",
  "lyrics": "[Intro: Nas, Raekwon, Casanova Rud, CL Smooth, (Kool G Rap) & (Snoop Dogg)]\nHold up and analyze\nCome on, get on, get some\nListen close as I prove my point\n(We do our thing, son) Yeah\nHold up and analyze, we’re more solid\nCome on, get on, get some, yeah\nListen close as I prove my point\n(Ready to make an entrance so back on up) Yeah\n\n[Chorus: Nas & A$AP Rocky]\nNo comparison, we more solid than they are (Uh)\nMe and Hit-Boy, they say we like the new Gang Starr (Uh)\nMe and Flacko, they say we the new wave gods\nShout to Max B, he could be home any day, God (Yeah)\n\n[Verse 1: A$AP Rocky]\nWake up out the bed scruffy, sparkin' my J\nShine my nickel-plated then I'm startin' my day\nMy old lady call me baby, told her, \"Pardon my age\"\nTwelve shells in the gauge like a carton of eggs\nWe goin' home like Eric Cartman, chromosomes on my conscience\nHear some n****s talkin' nonsense, call up Nasty Nastradamus\nRock the pearls and diamonds, break the promise, break her wallets\nBreak her heart and break her pockets, takin' notes like guidance counselors\nAristocrat like the chancellor, the answer to the, uh, panhandlers\nThe corners with the mans is up, the jig is up, the scams is up\nYeah, they hands is up, lookin' in the crowd, yeah\nTryna f*** the world, but my pants still up\nTryna invest, to all my G's, before we rest in peace\n'Cause we sure to rest in peace\nThe rest is set, the record set as soon as I release\nThe rumors be, I roam the streets with no security\nThey know a n**** overseas (Uh)\nKind of swag that's passed from your mom and dad\nPrada bags and we cheesin' on them Calvin ads (Yeah, yeah)\nMight've peeped the billboards fifty feet when out in traffic\nStarin' at them naked pictures, sh**, you bound to crash it\n\n[Chorus: Nas]\nNo comparison, we more solid than they are\nMe and Hit-Boy, they say we like the new Gang Starr\nMe and Flacko, they say we the new wave gods\nShout to Max B, he could be home any day, God\n\n[Break: Nas, Raekwon, Casanova Rud & A$AP Rocky]\nHold up and analyze\nYeah, A$AP Mob got Mass Appeal\nCome on, get on, get some\nCall up Nasty Nas, n****s hit the lick like ah, ah, ah\n\n[Verse 2: Nas]\nWake up out the bed, wrap my durag up\nSay a prayer, I'm thankin' God that mom dukes had us\nMonotone style like Guru on some Preemo cuts\nCrewneck by McQueen, go nuts\nJewels over my white hoodie like Juvie in '9-8\nIt's movies that I make, Peruvian white flake\nIt tore the community at a high rate, adversity I faced\nI roll my own gas to make sure that it's not laced\nDamn, I used to hit the block hopin' they see me\nWatchin' Video Music Box, sittin' close to the TV\nI was inspired by Whodini and Kool G\nGot my first pair of J's, thought I was 2-3 (Air)\nInvest in all my G's before we rest in peace\n'Cause we sure to rest in peace, my shorty is a piece\nA piece of mind, a dimepiece, I might buy her a piece of property\nYou might've had some joints, but ain't nothin' like me and Rocky seen\n\n[Chorus: Nas]\nNo comparison, we more solid than they are\nMe and Hit-Boy, they say we like the new Gang Starr\nMe and Flacko, they say we the new wave gods\nShout to Max B, he could be home any day, God\n\n[Break: Nas, Casanova Rud, Kool G Rap & C.L. Smooth]\nCome on, get on, get some\nYeah, A$AP Mob got Mass Appeal\nWe do our thing, son\nListen close as I prove my point\n\n[Outro: A$AP Rocky]\nTell Hit we got a hit, ayy, ayy\nTell Hit we got a hit, ahh\nCall up Nasty Nas, n****s hit the lick like ah, ah, ah"
}
,

{
  "iFrameUrl": "https://open.spotify.com/embed/track/1kcBpF3k98jzb25Y1p8qFY?utm_source=generator",
  "title": "Starstruck",
  "artist": "LUCKI",
  "length": "2:14",
  "credits": "Performed by: LUCKI, Written by: Erik Smaaland, Produced by: Cortdot",
  "album": "Single",
  "date": "February 15th, 2018",
  "lyrics": "[Intro]\nHa, ha\nAyy, ayy\n\n[Chorus]\nSeen too many faces for starstruck, ayy\nI was on the plane when you called me, ayy, uh\nMaybe not from the heart, but it's all me, ayy, uh\nMaybe you could wake up on the floor\n\n[Interlude]\nI don't preach, everything I need\nAre you ready?\nLook too far to see, woah, uh\nAyy, uh, ayy, uh, ayy, uh\nI don't preach, everything I need, look too far to—, uh, uh\nHey, uh\nHey, hey, uh\n\n[Verse 1]\nI don't preach, everything I need, look too far to see\nShe gon' reach, ho gon' be a ho, me gon' be a me\nBaby, please, you know how this go, only one of me\nBaby, woah, ayy, ayy, uh\nTech I bleed, on my daddy's see, ho f***essin' me?\nN****, please, I just got this pint, all the way from the Ps\nGettin' money, I been kinda clean, JaJa do my deeds\nMouths to feed, and more hearts to break, want me, you don't need\nDie or cheese, fifty in a month, f*** up out my dreams\nWhat you mean? I'm just one of one, I'm gone, you believe\nLet me see, take me out this world, love me like at least\nMiss my ex, she don't want the fame, she want her degree, woah, ayy\n\n[Chorus]\nSeen too many faces for starstruck, ayy\nI was on the plane when you called me, ayy, uh\nThat's not from the heart, but it's all me, ayy, uh\nMaybe you could wake up on the floor seats\n\n[Verse 2]\nI'm preventing coughs 'til my luck up, ayy, woah\nI'd rather you fake it than adore me, ayy, woah\nSeen too many faces to be starstruck, ayy, woah\nI was with some b****es when you called me, ayy, woah\nI don't do no liquor, that sh** all cheap, ayy, woah\nI think I went missin' when you called me, ayy, woah\nI need you to listen, 'cause it's all key, ayy, woah\nI don't even remember when you called me, ayy, woah"
}


]




